In [1]:
# Establishing a connection to the MySQL database
import mysql.connector
connection= mysql.connector.connect(
  host="127.0.0.1",
  user="root",
  password="2450",
  database="bank"
)

# Creating a cursor to execute SQL 
cursor = connection.cursor()

In [2]:
# displaying the customers values
query = "SELECT * FROM customers"
cursor.execute(query)
result = cursor.fetchall()
for row in result:
    print(row)

(1001, 'John', 'Doe', 'john.doe@example.com', '1234567890', '123 Main St')
(1002, 'Jane', 'Smith', 'jane.smith@example.com', '0987654321', '456 Elm St')
(1003, 'Michael', 'Johnson', 'michael.johnson@example.com', '9876543210', '789 Oak Ave')
(1004, 'Emily', 'Williams', 'emily.williams@example.com', '0123456789', '321 Pine Rd')
(1005, 'David', 'Brown', 'david.brown@example.com', '6789012345', '987 Maple Ln')
(1006, 'Sarah', 'Taylor', 'sarah.taylor@example.com', '5432167890', '654 Cedar St')
(1007, 'Christopher', 'Davis', 'christopher.davis@example.com', '8901234567', '789 Walnut Ave')
(1008, 'Jennifer', 'Miller', 'jennifer.miller@example.com', '7654321098', '432 Birch Rd')
(1009, 'Matthew', 'Anderson', 'matthew.anderson@example.com', '2345678901', '567 Oak Ave')
(1010, 'Amanda', 'Wilson', 'amanda.wilson@example.com', '9012345678', '876 Pine Rd')
(1011, 'john', 'son', 'john@gmail.com', '3637237283', '#044 hadra')

In [3]:
# displaying the transactions values
query = "SELECT * FROM transactions"
cursor.execute(query)
result1 = cursor.fetchall()
for row in result1:
    print(row)

(1, 1001, datetime.date(2023, 7, 1), 10, 5090)
(2, 1002, datetime.date(2023, 7, 5), 250, 5050)
(3, 1003, datetime.date(2023, 7, 3), 1000, 7000)
(4, 1004, datetime.date(2023, 7, 7), -500, 6500)
(5, 1005, datetime.date(2023, 7, 2), 300, 4000)
(6, 1006, datetime.date(2023, 7, 6), -150, 3850)
(7, 1007, datetime.date(2023, 7, 4), 800, 9000)
(8, 1008, datetime.date(2023, 7, 8), -300, 8700)
(9, 1009, datetime.date(2023, 7, 5), 200, 3000)
(10, 1010, datetime.date(2023, 7, 9), -100, 2900)

In [4]:
#for withdraw
account_no = int(input("enter the account no- "))  
withdraw =  int(input("enter the ammount in RS- "))  # Value to subtract from amount_balance

cursor.execute("""
    UPDATE transactions
     SET amount = %s, amount_balance = amount_balance - %s
    WHERE account_no = %s
""", (withdraw,withdraw, account_no))
connection.commit()

enter the account no- 1001
enter the ammount in RS- 90

In [5]:
query = "SELECT * FROM transactions"
cursor.execute(query)
result1 = cursor.fetchall()
for row in result1:
    print(row)

(1, 1001, datetime.date(2023, 7, 1), 90, 5000)
(2, 1002, datetime.date(2023, 7, 5), 250, 5050)
(3, 1003, datetime.date(2023, 7, 3), 1000, 7000)
(4, 1004, datetime.date(2023, 7, 7), -500, 6500)
(5, 1005, datetime.date(2023, 7, 2), 300, 4000)
(6, 1006, datetime.date(2023, 7, 6), -150, 3850)
(7, 1007, datetime.date(2023, 7, 4), 800, 9000)
(8, 1008, datetime.date(2023, 7, 8), -300, 8700)
(9, 1009, datetime.date(2023, 7, 5), 200, 3000)
(10, 1010, datetime.date(2023, 7, 9), -100, 2900)

In [6]:
#for deposit
account_no = int(input("enter the account no- "))  
deposit =  int(input("enter the ammount in RS- "))  # Value to add to the amount_balance


cursor.execute("""
    UPDATE transactions
    SET amount = %s, amount_balance = amount_balance + %s
    WHERE account_no = %s
""", (deposit, deposit, account_no))
connection.commit()

enter the account no- 1001
enter the ammount in RS- 20

In [7]:
query = "SELECT * FROM transactions"
cursor.execute(query)
result1 = cursor.fetchall()
for row in result1:
    print(row)

(1, 1001, datetime.date(2023, 7, 1), 20, 5020)
(2, 1002, datetime.date(2023, 7, 5), 250, 5050)
(3, 1003, datetime.date(2023, 7, 3), 1000, 7000)
(4, 1004, datetime.date(2023, 7, 7), -500, 6500)
(5, 1005, datetime.date(2023, 7, 2), 300, 4000)
(6, 1006, datetime.date(2023, 7, 6), -150, 3850)
(7, 1007, datetime.date(2023, 7, 4), 800, 9000)
(8, 1008, datetime.date(2023, 7, 8), -300, 8700)
(9, 1009, datetime.date(2023, 7, 5), 200, 3000)
(10, 1010, datetime.date(2023, 7, 9), -100, 2900)

In [5]:
#to get a value from the database
account_no = int(input("enter the account no- "))
cursor.execute("SELECT amount_balance FROM transactions WHERE account_no=%s;", (account_no,))

# Fetch the result
result = cursor.fetchone()
value = result[0]
print(value)

enter the account no- 1001
5100

In [18]:
# Define the new values to be inserted
account_no = int(input("enter the account no- "))
first_name = input("enter the first_name= ")
last_name = input("enter the last_name= ")
email = input("enter the email= ")
phone_number =input("enter the phone_no= ")
address = input("enter the address= ")

# Execute the INSERT statement
insert_query = "INSERT INTO customers (account_no, first_name, last_name, email, phone_number, address) VALUES (%s, %s, %s, %s, %s, %s)"
values = (account_no, first_name, last_name, email, phone_number, address)
cursor.execute(insert_query, values)
# Commit the changes
connection.commit()

enter the account no- 1011
enter the first_name= john
enter the last_name= son
enter the email= john@gmail.com
enter the phone_no= 3637237283
enter the address= #044 hadra

In [19]:
# displaying the customers values
query = "SELECT * FROM customers"
cursor.execute(query)
result = cursor.fetchall()
for row in result:
    print(row)

(1001, 'John', 'Doe', 'john.doe@example.com', '1234567890', '123 Main St')
(1002, 'Jane', 'Smith', 'jane.smith@example.com', '0987654321', '456 Elm St')
(1003, 'Michael', 'Johnson', 'michael.johnson@example.com', '9876543210', '789 Oak Ave')
(1004, 'Emily', 'Williams', 'emily.williams@example.com', '0123456789', '321 Pine Rd')
(1005, 'David', 'Brown', 'david.brown@example.com', '6789012345', '987 Maple Ln')
(1006, 'Sarah', 'Taylor', 'sarah.taylor@example.com', '5432167890', '654 Cedar St')
(1007, 'Christopher', 'Davis', 'christopher.davis@example.com', '8901234567', '789 Walnut Ave')
(1008, 'Jennifer', 'Miller', 'jennifer.miller@example.com', '7654321098', '432 Birch Rd')
(1009, 'Matthew', 'Anderson', 'matthew.anderson@example.com', '2345678901', '567 Oak Ave')
(1010, 'Amanda', 'Wilson', 'amanda.wilson@example.com', '9012345678', '876 Pine Rd')
(1011, 'john', 'son', 'john@gmail.com', '3637237283', '#044 hadra')
(1013, 'xs', 'sc', 'sc', '3', 'ws')

In [23]:
# Execute the DELETE statement
account_no = int(input("enter the account no- "))  
delete_query = "DELETE FROM customers WHERE account_no= %s"
value_to_remove = "Value to Remove"
cursor.execute(delete_query, (account_no,))
# Commit the changes
connection.commit()

enter the account no- 1013

In [24]:
# displaying the customers values
query = "SELECT * FROM customers"
cursor.execute(query)
result = cursor.fetchall()
for row in result:
    print(row)

(1001, 'John', 'Doe', 'john.doe@example.com', '1234567890', '123 Main St')
(1002, 'Jane', 'Smith', 'jane.smith@example.com', '0987654321', '456 Elm St')
(1003, 'Michael', 'Johnson', 'michael.johnson@example.com', '9876543210', '789 Oak Ave')
(1004, 'Emily', 'Williams', 'emily.williams@example.com', '0123456789', '321 Pine Rd')
(1005, 'David', 'Brown', 'david.brown@example.com', '6789012345', '987 Maple Ln')
(1006, 'Sarah', 'Taylor', 'sarah.taylor@example.com', '5432167890', '654 Cedar St')
(1007, 'Christopher', 'Davis', 'christopher.davis@example.com', '8901234567', '789 Walnut Ave')
(1008, 'Jennifer', 'Miller', 'jennifer.miller@example.com', '7654321098', '432 Birch Rd')
(1009, 'Matthew', 'Anderson', 'matthew.anderson@example.com', '2345678901', '567 Oak Ave')
(1010, 'Amanda', 'Wilson', 'amanda.wilson@example.com', '9012345678', '876 Pine Rd')
(1011, 'john', 'son', 'john@gmail.com', '3637237283', '#044 hadra')